Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t
The Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t struct represents the clipping planes of a view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t.Top
The top clipping plane.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t.Bottom
The bottom clipping plane.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t.Right
The right clipping plane.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t.Left
The left clipping plane.